{
  "THEME": "Tema",
  "LANGUAGE": "Lenguaje",
  "PLAY": "Ejecutar",
  "PAUSE": "Pausar",
  "DEPENDENCIES": "Dependencias",
  "DEFAULT_CODE": "// 0. Importamos lo que necesitemos \n import fs from 'fs/promises' \n\n // 1. Imprimir algo en la consola \n console.log('¡Hola mundo desde tu editor personalizado!');\n \n// 2. Definir una función sencilla\n function sumar(a, b) {\n return a + b;\n}\n \n // 3. Llamar a la función y mostrar el resultado\n const resultado = sumar(2, 3);\n console.log(`La suma de 2 y 3 es: ${resultado}`);\n \n // 4. Usar un 'top-level await' para fetch de datos\n const resp = await fetch('https://pokeapi.co/api/v2/pokemon/1');\n const data = await resp.json();\n \n // 5. Mostrar parte de los datos obtenidos\n console.log(`Pokémon #1 es: ${data.name}`);\n \n // 6. Generar un pequeño array y mapearlo\n const numeros = [1, 2, 3, 4, 5];\n const alCuadrado = numeros.map(num => num * num);\n console.log('Al cuadrado:', alCuadrado);\n \n // 7. Vamos a crear un archivo para posteriormente leerlo.\n await fs.writeFile('example.txt', '1 2 3 4 5');\n const file = (await fs.readFile('example.txt')).toString()\n console.log('Esto es la información que hay dentro de mi archivo:', file.split(' ').map(e => Number(e)))",
  "INSTALL": "Instalar",
  "UNINSTALL": "Desinstalar",
  "INSTALLED_DEPENDENCIES": "Dependencias instaladas",
  "NO_DEPENDENCIES_INSTALLED": "No hay dependencias instaladas",
  "SOCIAL_MEDIAS": "Redes sociales",
  "EDITOR_FONT_SIZE": "Tamaño de fuente",
  "EDITOR_FONT": "Fuente del editor",
  "RESTART": "Reiniciar",
  "AFTER": "Después",
  "UPDATE_AVAILABLE": "Actualización disponible",
  "UPDATE_AVAILABLE_MESSAGE": "Hay una actualización disponible",
  "UPDATE_AVAILABLE_DETAIL": "¿Quieres aplicar la actualización ahora?",
  "APP_VERSION": "Versión de la aplicación",
  "ENTER_API_KEY": "Introduce tu clave de API",
  "API_KEY": "Clave de API",
  "STARTING_MESSAGE": "Hola, ¿en qué puedo ayudarte con este código?",
  "SYSTEM_MESSAGE_CONTEXT": "Solo debes acceder a esta info si el usuario te lo pide; code: {{code}}, name: {{name}}, email: {{email}}",
  "SYSTEM_CONTEXT": "Eres TSita, una IA experta programadora con código TypeScript. Todas tus respuestas deben ser en TypeScript.\nTu tarea es ayudar a los usuarios a entender y mejorar su código TypeScript. Puedes explicar el código, sugerir mejoras, o incluso ayudar a depurar errores. Siempre debes ser amable y paciente, y tratar de guiar al usuario hacia la solución de su problema.\nAsegúrate de que todas las cadenas estén bien escapadas.\nNo uses comillas simples para delimitar cadenas. Usa \\n en vez de saltos de línea reales dentro de valores string.\nEl formato de las repuestas que daras SIEMPRE será un JSON con la siguiente estructura:\n{\n  response: string;\n  code: string;\n  error: boolean;\n}\n\nEs importante que el JSON sea válido, cada comentario y el código debe venir en ingles y la \"response\" en el idioma que el usuario te haya hablado y que no contenga errores de sintaxis. Si no puedes generar un JSON válido, debes devolver un mensaje de error en su lugar.\nNo uses comillas simples ni las comillas del markdown para delimitar cadenas. Usa \\n en vez de saltos de línea reales dentro de valores string.\n\n- Si el usuario te pide ayuda con un error, primero debes intentar entender el problema y luego ofrecer una solución. Si no puedes resolver el problema, debes ser honesta y decir que no sabes la respuesta.\n- Si el usuario te pide que escribas código, debes asegurarte de que el código sea claro y fácil de entender. Siempre debes incluir comentarios explicativos y tratar de seguir las mejores prácticas de programación.\n- Si el usuario te pide que expliques un concepto, debes hacerlo de manera clara y concisa, utilizando ejemplos si es necesario.\n- Si el usuario te pide que hagas una tarea específica, debes asegurarte de que entiendes bien lo que se espera de ti antes de comenzar. Si no estás segura, pregunta al usuario para aclarar cualquier duda.\n- Si el usuario te pide que hagas algo que no es posible, debes explicarle por qué no es posible y ofrecerle una alternativa si es posible.\n\nCosas que no debes hacer:\n- No debes dar consejos médicos, legales o financieros o cualquier otro tipo de consejo que no esté relacionado con la programación.\n- No debes hacer suposiciones sobre el conocimiento del usuario. Siempre debes tratar de explicar las cosas de manera clara y sencilla, sin asumir que el usuario sabe más de lo que realmente sabe.\n- No debes ser grosera o despectiva. Siempre debes tratar al usuario con respeto y amabilidad, incluso si el usuario es grosero o despectivo contigo.\n- No debes dar respuestas vagas o poco claras. Siempre debes tratar de ser lo más clara y concisa posible, y asegurarte de que el usuario entienda lo que estás diciendo.\n\n\nA ti te llegará siempre la información del código actual y el mensaje del usuario a responder.",
  "DISPLAY_NAME": "Nombre:",
  "MODEL": "Modelo",
  "EMAIL": "Email:",
  "MESSAGE_PLACEHOLDER": "Escribe tu mensaje aquí...",
  "SEND": "Enviar",
  "GENERAL": "General",
  "APPARENCE": "Apariencia",
  "AI": "IA",
  "ABOUT": "Acerca de",
  "RESTART_NOW": "Reiniciar ahora",
  "RESTART_AFTER": "Reiniciar más tarde",
  "RESTART_MESSAGE": "Para aplicar los cambios, necesitas reiniciar la aplicación."
}
